calories = {
    "한라봉":50,"딸기":34,"바나나": 77,"사과": 57,"포도" : 60,
    "수박" : 31,"참외" : 47,"파인애플" : 53,"복숭아" : 49,"오렌지" : 47,
    "키위" : 54,"석류" : 77,"애플망고" : 57,"귤" : 39, "천혜향" : 41,
    "레드향" : 48,"레몬" : 36,"블루베리" : 48,"자몽" : 32, "복분자" : 88,
    "멜론" : 21,"무화과" : 57, "유자" : 49, "망고스틴" : 71, "자두" : 26
            }
fruit = input("어떤 과일을 섭취하셨나요.")
# g = int(input("몇 g 섭취하셨나요."))
# kcal = calories[fruit]*g/100

if fruit in calories:
    g = int(input("몇 g 섭취하셨나요."))
    kcal = calories[fruit] * g / 100
    print("{} {}g은 {} kcal입니다.".format(fruit,g,kcal))
else :
    print("이 과일에 대한 kcal 정보가 없습니다.")
